GENERATE_CHAPTERS_LIST = 'Напиши список разделов для дипломной работы "{0}". Пиши только главные разделы, ' \
                         'без подразделов. Каждый раздел с новой строки, без цифр'
GENERATE_CHAPTER = 'Напиши раздел "{0}" для дипломной работы "{1}" в формате latex. ' \
                   'Представь, что работа уже написана'
BIBLIOGRAPHY = "Список использованных источников"
ENTER_NAME = "Введите название работы:\n"
GENERATE_BIBLIOGRAPHY = 'Напиши список использованных источников для дипломной работы "{0}" в формате latex. ' \
'Представь, что работа уже написана. Используй только русские и английские символы. Придумай имена авторов и названия' \
'источников.'
