GENERATE_CHAPTERS_LIST = 'Напиши список разделов для дипломной работы "{0}". Пиши только главные разделы, ' \
                         'без подразделов. Каждый раздел с новой строки, без цифр'
GENERATE_CHAPTER = 'Напиши раздел "{0}" для дипломной работы "{1}" в формате latex. ' \
                   'Представь, что работа уже написана'
BIBLIOGRAPHY = "Список использованных источников"
ENTER_NAME = "Введите название работы:\n"
GENERATE_BIBLIOGRAPHY = 'Напиши список использованных источников для дипломной работы "{0}" в формате latex. ' \
'Представь, что работа уже написана. Используй только русские и английские символы. Придумай имена авторов и названия' \
'источников.'
AMPERSAND_QUESTION = ('Является ли символ & в данном контексте разделителем ячеек в таблице latex?\n{0}', 'нет')
DOLLAR_QUESTION = ('Является ли символ $ в данном контексте обозначением формулы latex?\n{0}', 'нет')
WORK_NAME = "Какое название курсовой работы имел в виду пользователь?\n{0}\nНапиши только название работы"
SECTIONS_QUESTION = "Есть ли в этом тексте список тем?\n{0}"
SECTIONS_LIST_QUESTION = "Выведи только список тем из этого текста. Выведи каждую тему с новой строки без лишних " \
                         "символов\n{0}"
