START_MESSAGE = "👋Привет!\nЭто бот проекта Scribo. В нём ты можешь получить " \
                "курсовую или дипломную работу всего за 99 рублей!\n" \
                "🔥В данный момент действует акция: <b>бесплатная</b> генерация половины работы!\n" \
                "<b>Выбери желаемое действие:</b>"
MENU_MESSAGE = "😻Это бот проекта Scribo. В нём ты можешь получить курсовую " \
                "или дипломную работу всего за 99 рублей!\n" \
                "🔥В данный момент действует акция: <b>бесплатная</b> генерация половины работы!\n" \
                "<b>Выбери желаемое действие:</b>"
ABOUT_MESSAGE = "🤖Scribot — это уникальный телеграм-бот, разработанный с использованием технологии ChatGPT🧠. " \
                "Его основная функциональность — генерация курсовых и дипломных работ с нуля. Все работы, созданные " \
                "с помощью Scribot, абсолютно уникальны🌟\n\n💙Команда Scribo ценит конфиденциальность своих " \
                "пользователей и гарантирует, что ваша работа не будет опубликована в интернет или предоставлена " \
                "третьим лицам. Ваша работа защищена и будет использована исключительно вами🔒\n\n⏳Важно отметить, что " \
                "Scribot находится на этапе разработки. Если у вас возникнут вопросы или проблемы при использовании " \
                "бота, пожалуйста, обращайтесь к представителю бота: @nikpeg. Он с удовольствием поможет вам " \
                "разобраться с любой проблемой❤️\n\n✍👀Прочитайте отзывы о работе бота по ссылке: " \
                "docs.google.com/spreadsheets/d/1lnW0Rm5TsFEAM__c05odcggWyXn38gFtD1lvw8pQTBw/ " \
                "Некоторые из них: \"Во первых очень четко и быстро. Во вторых все соответствует требованиям\", " \
                "\"Соответствие теме, быстрый ответ, соответствие ГОСТу\", \"Быстро, хорошо написано\"🥰\n\n" \
                "📝Если вы уже воспользовались Scribot, пройдите небольшой опрос, " \
                "чтобы улучшить работу бота: https://forms.gle/8L2trfDS3dmDxT2S7\nИли отправьте донат, чтобы " \
                "поддержать проект: https://pay.cloudtips.ru/p/7a822105\n\n🔥Приятного использования и отличных " \
                "курсовых и дипломных работ!"
CONNECT_MESSAGE = "☎По любым вопросам и предложениям пиши представителю команды Scribo — @nikpeg.\n\n" \
                  "Ответы на многие вопросы уже есть в нашем телеграм-канале!"
GENERATE_MESSAGE = "<b>✨Введи название нужной тебе работы!✨</b>\n\n" \
                   "📝Пример: <code>{0}</code>\n" \
                   "⬅️Для отмены ввода — /cancel"
STATUS_MESSAGE = "❤Спасибо! Работа начинает генерироваться. Пожалуйста, ожидайте!\n" \
                          "⏳Среднее время создания работы — 10 минут.\n" \
                          "Готовность работы: {0}"
WORK_SIZE_MESSAGE = "Выберете, пожалуйста, <b>сколько листов<\b> должно быть в работе \"{0}\""
PAID_MESSAGE = "🥺Спасибо за оплату! Ожидай оформленную работу в течение 24 часов. Пожалуйста, не останавливай бота, " \
               "чтобы он смог отправить тебе готовый документ"
WORK_MESSAGE = "💋Отлично, спасибо! Напоминаю, что нужно отправить готовую курсовую работу, " \
               "сгенерированную в chatGPT. Для отправки работы" \
               " просто отправь её боту (выбранный раздел не имеет значения)"
SENT_WORK_MESSAGE = "User {0} @{1} sent work {2}"
BUTTON_PRESSED_MESSAGE = "User {0} @{1} pressed {1} button"
UNKNOWN_WORK_MESSAGE = "User {0} @{1} id is not known!"
GENERATE_AGAIN_MESSAGE = "К сожалению, работа не найдена. <b>✨Пожалуйста, введи название нужной тебе работы ещё раз!✨</b>\n\n" \
               "📝Пример: <code>{0}</code>\n" \
               "⬅️Для отмены ввода — /cancel"
ATTEMPT_MESSAGE = "Попытка {0}..."
PROBLEM_MESSAGE = "😭Проблема с работой"
WRONG_WORK_MESSAGE = "Ты уже оформляешь работу! Сначала отправь предыдущую, чтобы взять новую."
LIST_MESSAGE = "⏰Список доступных для проверки работ. Напоминаю, что каждую из них нам нужно проверить в течение 24" \
               "часов с момента отправки. Ответь на неё \"Беру\", чтобы взять в работу (свайпни сообщение с файлом" \
               " влево и напиши \"беру\"):"
EMPTY_LIST_MESSAGE = "😎Список доступных для проверки работ пуст. Отдыхаем!"
IDK_MESSAGE = "🤔Пока я не знаю такой команды. Попробуй /start"
WRONG_REPLY_MESSAGE = "Для выбора работы ответь на одно из сообщений"
GOOD_WORK_MESSAGE = "😍Спасибо, хорошая работа! Будем надеяться, что пользователь останется доволен"
READY_MESSAGE = "❤️Спасибо за оплату работы! Мы надеемся, что бот сработал правильно\n\n" \
                "Пройди небольшой опрос, чтобы улучшить работу бота: https://forms.gle/8L2trfDS3dmDxT2S7\n\n" \
                "Ждём тебя снова!"
FREE_MESSAGE = "👍Оформление бесплатной половины работы готово! Отправь <b>{price} рублей</b> по ссылке:\n" \
                "https://pay.cloudtips.ru/p/7a822105\n" \
                "и нажми кнопку 'Я оплатил', чтобы получить <b>полную версию</b> курсовой работы!"
WAIT_MESSAGE = "⏳Ожидаем подтверждения оплаты от модераторов. Пожалуйста, подожди несколько минут!\n" \
               "В случае длительной задержки, пиши автору бота: @nikpeg"
REALLY_PAID_MESSAGE = "😋Кайффф, спасибо!😋"
NOT_PAID_MESSAGE = "🙃Мда, трэш🙃"
WRONG_MESSAGE = "🤔К сожалению, модераторы не обнаружили твоей оплаты. Отправь <b>{price} рублей</b> по ссылке:\n" \
                "https://pay.cloudtips.ru/p/7a822105\n" \
                "и нажми кнопку '✅Я оплатил', чтобы получить <b>полную версию</b> курсовой работы!\n" \
                "В случае возникновения вопросов об оплате, пиши автору бота: @nikpeg"
PAID_QUESTION_MESSAGE = "❓Пользователь {} @{} говорит, что оплатил работу. Это правда?)"
NO_WORKS_MESSAGE = "🤔В данный момент у тебя нет работ для оформления. Возьми новую в списке"
PAID_PROBLEM_MESSAGE = "⏳Извини, возникла проблема с отправкой работы. Модераторы уже уведомлены, и в ближайшее время" \
                        " сгенерируют Вашу работу вручную. В случае возникновения проблем, пиши автору бота: @nikpeg"
